LES-rhoEnergyFoam-DLR-buffet-coarseMesh/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
97664
(
(0.273506 0.0264372 -0.003)
(0.270519 0.0264373 -0.003)
(0.267535 0.0264373 -0.003)
(0.264559 0.0264374 -0.003)
(0.261592 0.0264375 -0.003)
(0.258638 0.0264377 -0.003)
(0.255697 0.0264378 -0.003)
(0.252774 0.026438 -0.003)
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<vector> 
144
(
(-0.205 -0.0214973 -0.003)
(-0.205 -0.0211535 -0.003)
(-0.205 -0.0208098 -0.003)
(-0.205 -0.020466 -0.003)
(-0.205 -0.0201223 -0.003)
(-0.205 -0.0197785 -0.003)
(-0.205 -0.0194348 -0.003)
(-0.205 -0.019091 -0.003)
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<vector> 
144
(
(0.275 0.0264372 -0.003)
(0.275 0.026781 -0.003)
(0.275 0.0271247 -0.003)
(0.275 0.0274685 -0.003)
(0.275 0.0278122 -0.003)
(0.275 0.028156 -0.003)
(0.275 0.0284997 -0.003)
(0.275 0.0288435 -0.003)
...
)
;
    }
    Blade
    {
        type            calculated;
        value           nonuniform List<vector> 
504
(
(6.22808e-05 -3.06482e-05 -0.003)
(9.03082e-05 -3.2187e-05 -0.003)
(0.000118364 -3.21299e-05 -0.003)
(0.000146374 -3.03985e-05 -0.003)
(0.000174187 -2.66799e-05 -0.003)
(0.000201655 -2.09159e-05 -0.003)
(0.000228629 -1.31834e-05 -0.003)
(0.000254978 -3.53044e-06 -0.003)
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
