LES-rhoEnergyFoam-DLR-buffet-coarseMesh/constant/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
97664
(
0.0264372
0.0264373
0.0264373
0.0264374
0.0264375
0.0264377
0.0264378
0.026438
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
-0.0214973
-0.0211535
-0.0208098
-0.020466
-0.0201223
-0.0197785
-0.0194348
-0.019091
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
0.0264372
0.026781
0.0271247
0.0274685
0.0278122
0.028156
0.0284997
0.0288435
...
)
;
    }
    Blade
    {
        type            calculated;
        value           nonuniform List<scalar> 
504
(
-3.06482e-05
-3.2187e-05
-3.21299e-05
-3.03985e-05
-2.66799e-05
-2.09159e-05
-1.31834e-05
-3.53044e-06
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
