LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
97664
(
0.551787
0.549687
0.549467
0.550516
0.553632
0.558257
0.56301
0.566617
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
1.05421
1.05426
1.05432
1.05438
1.05444
1.05448
1.05454
1.05459
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
0.551787
0.551791
0.551798
0.551816
0.551845
0.551884
0.55193
0.551987
...
)
;
    }
    Blade
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
