LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/UMean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
97664
(
(129.823 179.22 -1.09499e-16)
(131.781 173.467 -1.31653e-16)
(133.197 171.669 -1.20051e-16)
(132.248 172.004 -1.13857e-16)
(129.186 175.302 -9.46847e-17)
(125.774 180.04 -7.45667e-17)
(123.536 185.89 -3.15593e-17)
(125.198 187.633 7.41067e-18)
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<vector> 
144
(
(191.139 310.005 -1.64887e-20)
(195.306 312.799 1.36106e-20)
(187.283 316.148 -1.98216e-21)
(187.072 315.767 5.71387e-22)
(193.856 312.598 -9.1876e-21)
(196.576 320.322 2.21707e-21)
(188.595 319.623 1.20119e-21)
(188.422 319.059 2.62567e-22)
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<vector> 
144
(
(129.823 179.22 -1.09499e-16)
(130.78 179.513 -1.08773e-16)
(131.656 179.752 -1.09963e-16)
(132.55 180.053 -1.0937e-16)
(133.451 180.199 -1.09953e-16)
(134.239 180.326 -1.09582e-16)
(135.139 180.465 -1.09917e-16)
(135.866 180.693 -1.0887e-16)
...
)
;
    }
    Blade
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
