LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
97664
(
23.7097
24.2696
24.7626
25.1991
25.5854
25.922
26.2259
26.5562
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           nonuniform List<scalar> 
144
(
503.967
504.021
504.079
504.138
504.189
504.235
504.284
504.332
...
)
;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform 45937.5;
        value           nonuniform List<scalar> 
144
(
23.7097
23.706
23.7021
23.6979
23.6934
23.6887
23.6838
23.6786
...
)
;
    }
    Blade
    {
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
504
(
0.247189
0.426068
0.640949
0.868478
1.13311
1.36185
1.52319
1.65138
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
