LES-rhoEnergyFoam-DLR-buffet-coarseMesh/0/pPrime2Mean
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pPrime2Mean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [2 -2 -4 0 0 0 0];

internalField   nonuniform List<scalar> 
97664
(
233017
300054
508704
892448
625708
218681
157548
19338.9
...
)
;

boundaryField
{
    PER_LEFT_1
    {
        type            cyclic;
    }
    PER_RIGHT_1
    {
        type            cyclic;
    }
    PER_LEFT_2
    {
        type            cyclic;
    }
    PER_RIGHT_2
    {
        type            cyclic;
    }
    PER_LEFT_3
    {
        type            cyclic;
    }
    PER_RIGHT_3
    {
        type            cyclic;
    }
    INLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
259104
778170
2.01892e+07
1.75856e+07
628619
3.71717e+06
3.87987e+07
3.47873e+07
...
)
;
    }
    OUTLET
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
189318
181604
190962
170139
147244
157548
177211
199712
...
)
;
    }
    Blade
    {
        type            calculated;
        value           nonuniform List<scalar> 
504
(
1.62716e+07
1.82278e+06
196774
31416.9
2.32273e+06
5.79134e+06
1.32269e+07
1.9448e+07
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
